Revit 2024 API
ComponentRotation Enumeration
ComponentRotation property of DividedSurface. See DividedSurface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum ComponentRotation
Visual Basic
Public Enumeration ComponentRotation
Visual C++
public enum class ComponentRotation
Members
Member name | Description
Angle0
Angle90
Angle180
Angle270
See Also
Autodesk.Revit.DB Namespace